```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # random_integer.example will be created
  + resource "random_integer" "example" {
      + id     = (known after apply)
      + max    = 100
      + min    = 1
      + result = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + random_number = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: .tofuplan

To perform exactly these actions, run the following command to apply:
    tofu apply ".tofuplan"

```
